{"name":"Arhum Khan","headerTaglineOne":"Hello 👋","headerTaglineTwo":"I'm Arhum Khan - curious","headerTaglineThree":"enthusiastic and a developer","headerTaglineFour":" based in Atlanta, Georgia.","showCursor":true,"showBlog":false,"darkMode":true,"showResume":true,"socials":[{"id":"2","title":"LinkedIn","link":"https://www.linkedin.com/in/arhumk/"},{"id":"5","title":"Email","link":"mailto:arhumk340@gmail.com"}],"projects":[{"id":"1","title":"Software Developer","description":"UnitedHealthCare","imageSrc":"https://assets.zencare.co/content/2021/08/United_Healthcare_logo_PNG1-1.png","url":"https://www.uhc.com"},{"id":"2","title":"Software Developer","description":"GetInLine Inc.","imageSrc":"https://static.wixstatic.com/media/760a51_5570a343a79543578202fbd9a16cc448~mv2.png/v1/fill/w_582,h_455,fp_0.50_0.50,lg_1,q_85,enc_auto/760a51_5570a343a79543578202fbd9a16cc448~mv2.png","url":"https://www.getinline.org"},{"id":"3","title":"Software Developer","description":"Delta Air Lines","imageSrc":"https://s3-symbol-logo.tradingview.com/delta-air-lines--600.png","url":"https://www.delta.com"},{"id":"4","title":"Researcher ","description":"Georgia Tech ","imageSrc":"https://upload.wikimedia.org/wikipedia/commons/thumb/b/bf/Georgia_Tech_Yellow_Jackets_logo.svg/2560px-Georgia_Tech_Yellow_Jackets_logo.svg.png","url":"https://www.gatech.edu"}],"services":[],"aboutpara":"Hey there! 👋 I'm Arhum Khan, a Computer Science student at Georgia Tech set to graduate in December 2023. 🎓 Software engineering is my passion, and I've been fortunate to gain hands-on experience through awesome internships and exciting projects! 💻 When I'm not immersed in coding, you can catch me shooting hoops on the basketball court 🏀 or having a blast hanging out with my amazing friends! 🎉 Let's create some incredible tech together and have a ton of fun along the way! 🚀😄","resume":{"tagline":"👋  I'm a software engineer","description":"","experiences":[{"id":"1","dates":"June 2023 – August 2023","type":"Intern","position":"Software Engineer @ UHC","bullets":"Actively participate in agile development processes by attending daily stand-up meetings and providing valuable input during sprint planning, Contributing to the team’s successful delivery of project milestones, Developing APIs and a user interface (UI) within a collaborative team to facilitate the management and maintenance of system users using a variety of software tools, Leveraging Java and Spring Boot to construct robust back-end APIs ensuring seamless integration with the user database, Employing Angular to design an intuitive and interactive front-end interface  enhancing user experience and facilitating efficient database interactions,  Implementing comprehensive quality engineering practices including JUnit testing; Jenkins automation, PostgreSQL, and DBeaver database management to ensure the reliability and functionality of the developed code"},{"id":"d495c23b-4f65-479a-9b8a-cfbc1c089725","dates":"August 2022 – May 2023","type":"Intern","position":"Software Engineer @ GetInLine Inc.","bullets":"Served as team lead responsible for supervising the team’s activities and delegating tasks through the Jira platform while maintaining an Agile environment, Created a Figma design of website UI and system architecture specifications and assisted in the development of documentation for deployment, Designed and developed functional and interactive components for the website including the main page using ReactJS and Bootstrap, Actively participated in code reviews and provided constructive feedback to team members promoting code quality and adherence to best practices, Utilized Google Firebase as back-end database to store user and service information and to retrieve related data to display to users on dashboard"},{"id":"15134842-e4ef-4748-a218-1c68e3ee3092","dates":"May 2022 – August 2022","type":"Intern","position":"Software Engineer @ Delta Air Lines","bullets":"Collaborated with team developers in Agile environment and utilized Angular with HTML/CSS to develop components on the Delta Vacations website, Coordinated with cross-functional teams such as product management and UI/UX design to deliver effective solutions,  Utilized Angular libraries and frameworks and restructured existing code to develop more modernized front-end webpage,  Created queries in AWS CloudWatch to collect and aggregate Lambda metrics of airplane passengers and created logs in Sumologic to send alerts to team if any errors occurred"},{"id":"8de6f432-f649-4929-9688-1a6b6e286983","dates":"September 2021 – December 2021","type":"Research","position":"Researcher @ Georgia Tech","bullets":"Worked on Virtual Reality situational awareness project helping to develop and prototype systems to enhance awareness of the outside world and user experience for VR system users, Developed software code and scripts to support research experiments and prototypes utilizing Unity and C#, Attended weekly meetings with mentor to discuss progress of conducted research on VR technologies and situational awareness,  Analyzed research data to identify emerging trends and patterns and to apply insights to guide decisions and recommendations"}],"education":{"universityName":"Georgia Institute of Technology","universityDate":"December 2023","universityPara":"Concentration in Human Computer Interaction and Intelligence "},"languages":["Javascript","HTML5","CSS","Python "],"frameworks":["React","Angluar","SpringBoot"],"others":["Figma","AWS"]}}